// ЗАНЯТИЕ 29 - ФУНКЦИИ

// ЗАДАНИЕ 1: Напишите функцию, которая получает три числа и возвращает их сумму.

// КОД ЗАДАНИЯ 1 ---------------------------------------------------------------------------------------------------------------------------------------------------------

// function sumOfThree(arg1, arg2, arg3) {
//     return arg1 + arg2 + arg3;
// }

// let number1 = 0;
// let error = "";
// do {
//     number1 = +prompt(error + 'Введите первое число');
//     error = 'Вы ввели неверные данные! ВНИМАНИЕ! ';
// } while (isNaN(number1));
// let number2 = 0;
// error = "";
// do {
//     number2 = +prompt(error + 'Введите второе число');
//     error = 'Вы ввели неверные данные! ВНИМАНИЕ! ';
// } while (isNaN(number2));
// let number3 = 0;
// error = "";
// do {
//     number3 = +prompt(error + 'Введите третье число');
//     error = 'Вы ввели неверные данные! ВНИМАНИЕ! ';
// } while (isNaN(number3));

// console.log("Сумма введенных вами чисел - " + sumOfThree(number1, number2, number3));

// КОНЕЦ КОДА ЗАДАНИЯ 1 -------------------------------------------------------------------------------------------------------------------------------------------------

// ЗАДАНИЕ 2: Напишите функцию, которая подсчитывает сумму чисел от 1 до заданного X.

// КОД ЗАДАНИЯ 2 ---------------------------------------------------------------------------------------------------------------------------------------------------------

// let numberX = 0;
// let error = "";
// do {
//     numberX = +prompt(error + 'Введите число');
//     error = 'Вы ввели неверные данные! ВНИМАНИЕ! ';
// } while (isNaN(numberX));

// let i = 0;
// function sumOfX(numberX) {
//     for (step = 1; step <= numberX; step++) {
//         i = i + step;
//     }
//     return i;
// }
// console.log("Сумма чисел от 1 до введенного Вами числа - " + sumOfX(numberX));

// КОНЕЦ КОДА ЗАДАНИЯ 2 -------------------------------------------------------------------------------------------------------------------------------------------------

// ЗАДАНИЕ 4: Напишите функцию, которая считает факториал числа.

// КОД ЗАДАНИЯ 4 ---------------------------------------------------------------------------------------------------------------------------------------------------------

// let numberX = 0;
// let error = "";
// do {
//     numberX = +prompt(error + 'Введите число');
//     error = 'Вы ввели неверные данные! ВНИМАНИЕ! ';
// } while (isNaN(numberX));

// let i = 1;
// function factOfX(numberX) {
//     for (step = 1; step <= numberX; step++) {
//         i = i * step;
//     }
//     return i;
// }
// console.log("Факториал введенного вами числа - " + BigInt(factOfX(numberX)));

// КОНЕЦ КОДА ЗАДАНИЯ 4 -------------------------------------------------------------------------------------------------------------------------------------------------

// ЗАДАНИЕ 3: Напишите функцию, которая подсчитывает сумму цифр числа.

// КОД ЗАДАНИЯ 3 ---------------------------------------------------------------------------------------------------------------------------------------------------------

let numberX = 0;
let error = "";
do {
    numberX = +prompt(error + 'Введите число');
    error = 'Вы ввели неверные данные! ВНИМАНИЕ! ';
} while (isNaN(numberX));

let sum = 0;
function sumOfDigit(numberX) {
    do {
        sum += numberX % 10;
        numberX = numberX / 10 - (numberX / 10) % 1;
    } while (numberX > 0);
    return sum;
}
console.log('Сумма введенного вами числа - ' + sumOfDigit(numberX));

// КОНЕЦ КОДА ЗАДАНИЯ 3 -------------------------------------------------------------------------------------------------------------------------------------------------