// ЗАНЯТИЕ 32 - ФУНКЦИИ

// ЗАДАНИЕ 1: Создайте функцию, которая принимает три числа: два первых должны быть длиной сторон катетов прямоугольного треугольника, а третье – длиной гипотенузы. Функция возвращает true, если такой прямоугольный треугольник возможен, и false, если нет.

// КОД ЗАДАНИЯ 1 ---------------------------------------------------------------------------------------------------------------------------------------------------------

// let number1 = 0;
// let error = "";
// do {
//     number1 = +prompt(error + 'Введите первое число - катет 1');
//     error = 'Вы ввели неверные данные! ВНИМАНИЕ! ';
// } while (isNaN(number1));
// let number2 = 0;
// error = "";
// do {
//     number2 = +prompt(error + 'Введите второе число - катет 2');
//     error = 'Вы ввели неверные данные! ВНИМАНИЕ! ';
// } while (isNaN(number2));
// let number3 = 0;
// error = "";
// do {
//     number3 = +prompt(error + 'Введите третье число - гипотенуза');
//     error = 'Вы ввели неверные данные! ВНИМАНИЕ! ';
// } while (isNaN(number3));

// function checkTriangle(arg1, arg2, arg3) {
//     if ((arg1 ** 2) + (arg2 ** 2) === arg3 ** 2) {
//         console.log("Такой прямоугольный треугольник существует");
//     } else {
//         console.log("Такого прямоугольного треугольника не существует");
//     }
// }
// checkTriangle(number1, number2, number3);

// КОНЕЦ КОДА ЗАДАНИЯ 1 -------------------------------------------------------------------------------------------------------------------------------------------------

// ЗАДАНИЕ 2: Создайте функцию repeat(str, n), которая возвращает строку, состоящую из n повторений строки str. По умолчанию n=2, str — пустая строка.

// КОД ЗАДАНИЯ 2 ---------------------------------------------------------------------------------------------------------------------------------------------------------

// let string1 = prompt('Введите cообщение');
// let number1 = 0;
// let error = "";
// do {
//     number1 = +prompt(error + 'Введите число повторений');
//     error = 'Вы ввели неверные данные! ВНИМАНИЕ! ';
// } while (isNaN(number1) || number1 < 0);

// function repeatMessage(str = "", n = 2) {
//     let sum = "";
//     for (let step = 0; step < n; step++) {
//         sum += str;
//     }
//     console.log(sum);
// }

// repeatMessage(string1, number1);


// КОНЕЦ КОДА ЗАДАНИЯ 2 -------------------------------------------------------------------------------------------------------------------------------------------------

// ЗАДАНИЕ 3: Создайте функцию, которая принимает два аргумента – количество учеников в классе и количество парт в кабинете. Функция возвращает строку вида «не хватает 2 парт» / «1 лишняя парта».

// КОД ЗАДАНИЯ 3 ---------------------------------------------------------------------------------------------------------------------------------------------------------

// let number1 = 0;
// let error = "";
// do {
//     number1 = +prompt(error + 'Введите количество учеников');
//     error = 'Вы ввели неверные данные! ВНИМАНИЕ! ';
// } while (isNaN(number1));
// let number2 = 0;
// error = "";
// do {
//     number2 = +prompt(error + 'Введите количество парт в классе');
//     error = 'Вы ввели неверные данные! ВНИМАНИЕ! ';
// } while (isNaN(number2));

// function checkSeats(arg1, arg2) {
//     if (arg1 / 2 == arg2) {
//         console.log("Парт хватает")
//     } else if (arg1 / 2 > arg2) {
//         ifLessSeats(number1, number2);
//     } else if (arg1 / 2 < arg2) {
//         ifMoreSeats(number1, number2);
//     }
// }

// function ifLessSeats(arg1, arg2) {
//     if (!((((arg1 / 2) / arg2) % 2) == 0)) {
//         console.log("Не хватает парт - " + (((arg1 / 2) - arg2) + (((arg1 / 2) - arg2) % 1)));
//     } else {
//         console.log("Не хватает 1 парты");
//     }
// }

// function ifMoreSeats(arg1, arg2) {
//     if (!((arg2 - arg1 / 2) % 2 == 0)) {
//         console.log("Лишних парт - " + (arg2 - (arg1 / 2) - ((arg2 - (arg1 / 2)) % 1)));
//     } else {
//         console.log("1 парта лишняя");
//     }
// }

// checkSeats(number1, number2);


// КОНЕЦ КОДА ЗАДАНИЯ 3 -------------------------------------------------------------------------------------------------------------------------------------------------

// ЗАДАНИЕ 4: Создайте функцию, которая получает в качестве аргумента оценку по 10-балльной шкале. Для ошибочных аргументов (0, «B») функция возвращает текстовую ошибку, для верных – их текстовое описание:

// КОД ЗАДАНИЯ 4 ---------------------------------------------------------------------------------------------------------------------------------------------------------

// let number1 = 0;
// let error = "";
// do {
//     number1 = +prompt(error + 'Введите оценку по десятибалльной шкале');
//     error = 'Вы ввели неверные данные! ВНИМАНИЕ! ';
// } while (isNaN(number1));

// function checkGrade(number1) {
//     switch (number1) {
//         case 1:
//         case 2:
//             console.log("Unsatisfactory");
//             break;
//         case 3:
//         case 4:
//             console.log("Satisfactory");
//             break;
//         case 5:
//             console.log("Almost good")
//             break;
//         case 6:
//             console.log("Good")
//             break;
//         case 7:
//             console.log("Very good");
//             break;
//         case 8:
//             console.log("Almost Excellent");
//             break;
//         case 9:
//             console.log("Excellent");
//             break;
//         case 10:
//             console.log("Brilliant");
//             break;
//         default:
//             console.log("Такой оценки не существует");
//     }
// }
// checkGrade(number1);

// КОНЕЦ КОДА ЗАДАНИЯ 4 -------------------------------------------------------------------------------------------------------------------------------------------------

// ЗАДАНИЕ 5: Используя цикл do..while, создайте функцию, которая принимает числа через prompt(), пока не будет введено число 0.

// КОД ЗАДАНИЯ 5 ---------------------------------------------------------------------------------------------------------------------------------------------------------

// let numberX;
// function checkNumberX(numberX) {
//     do {
//         numberX = +prompt("Введите число Х");
//     } while (!(numberX === 0));
//     console.log("Верно")
// }
// checkNumberX(numberX);

// КОНЕЦ КОДА ЗАДАНИЯ 5 -------------------------------------------------------------------------------------------------------------------------------------------------

// ЗАДАНИЕ 6: Перепишите функцию из задачи 5 так, чтобы она принимала числа, пока их сумма остаётся меньше 100, выводила эту сумму в консоль, а возвращала количество введённых чисел.

// КОД ЗАДАНИЯ 6 ---------------------------------------------------------------------------------------------------------------------------------------------------------

// let numberX = 0;
// let sum = 0;
// let step = 0;
// function sumToHundred(numberX) {
//     do {
//         numberX = +prompt("Введите число Х");
//         sum += numberX;
//         console.log("Текущая сумма : " + sum);
//         step++;
//     } while (sum < 100);
//     if (sum > 100) {
//         console.log("Сумма превысила 100");
//         console.log("Количество введенных чисел: " + step);
//     } else {
//         console.log("Итоговая сумма : " + sum);
//         console.log("Количество введенных чисел: " + step);
//     }
// }

// sumToHundred(numberX);

// КОНЕЦ КОДА ЗАДАНИЯ 6 -------------------------------------------------------------------------------------------------------------------------------------------------

// ЗАДАНИЕ 7: Создайте функцию, которая принимает число в качестве аргумента и проверяет, является ли это число простым.

// КОД ЗАДАНИЯ 7 ---------------------------------------------------------------------------------------------------------------------------------------------------------

// let numberX = 0;
// let error = "";
// do {
//     numberX = +prompt(error + 'Введите число');
//     error = 'Вы ввели неверные данные! ВНИМАНИЕ! ';
// } while (isNaN(numberX));

// function checkNumber(numberX) {
//     let divider = 1;
//     let sum = 0;
//     if (numberX == 1) {
//         console.log("Это число является простым")
//     } else {
//         for (divider = 1, sum = 0; divider <= numberX; divider++) {
//             if (!(numberX % divider == 0))
//                 continue;
//             sum += divider;
//             // console.log("Делитель - " + divider);
//             // console.log("Сумма делителей - " + sum);
//         }
//         if (sum == 1 + numberX) {
//             console.log("Это число является простым");
//         } else {
//             console.log("Это число не является простым");
//         }
//     }
// }

// checkNumber(numberX);

// КОНЕЦ КОДА ЗАДАНИЯ 7 -------------------------------------------------------------------------------------------------------------------------------------------------

// ЗАДАНИЕ 8: Создайте функцию, которая принимает в качестве аргумента целое число, соответствующее порядковому номеру месяца. Если месяц с таким номером существует, функция возвращает имя сезона (лето, осень, зима, весна), к которому относится месяц. Если нет –сообщение об ошибке.

// КОД ЗАДАНИЯ 8 ---------------------------------------------------------------------------------------------------------------------------------------------------------

// let numberX = 0;
// let error = "";
// do {
//     numberX = +prompt(error + 'Введите число, соответствующее месяцу');
//     error = 'Вы ввели неверные данные! ВНИМАНИЕ! ';
// } while (isNaN(numberX));

// function checkMonth(numberX) {
//     switch (numberX) {
//         case 12:
//         case 1:
//         case 2:
//             console.log('Зима');
//             break;
//         case 3:
//         case 4:
//         case 5:
//             console.log('Весна');
//             break;
//         case 6:
//         case 7:
//         case 8:
//             console.log('Лето');
//             break;
//         case 9:
//         case 10:
//         case 11:
//             console.log('Осень');
//             break
//         default:
//             console.log('Месяца с таким номером не существует');
//     }
// }
// checkMonth(numberX);

// КОНЕЦ КОДА ЗАДАНИЯ 8 -------------------------------------------------------------------------------------------------------------------------------------------------

// ЗАДАНИЕ 9: Создайте функцию, которая выводит в консоль числа от 10 до 99, заканчивающиеся на 7 или делящиеся на 7 (в убывающем порядке).

// КОД ЗАДАНИЯ 9 ---------------------------------------------------------------------------------------------------------------------------------------------------------

// function luckyNumber() {
//     let i = 99;
//     while (i > 10) {
//         if (i % 7 == 0 || i % 10 == 7) {
//             console.log(i)
//         };
//         i--;
//     }
// }
// luckyNumber();

// КОНЕЦ КОДА ЗАДАНИЯ 9 -------------------------------------------------------------------------------------------------------------------------------------------------

// ЗАДАНИЕ 10: Создайте функцию, которая для чисел от 2 до 20 выводит в консоль все их делители.

// КОД ЗАДАНИЯ 10 ---------------------------------------------------------------------------------------------------------------------------------------------------------

// function showDividers() {
//     let i = 2;
//     do {
//         console.log('Делители числа ' + i + " - " + calcDividers(i));
//         i++;
//     } while (i <= 20);
// }

// function calcDividers(i) {
//     let sum = " ";
//     let comma = " , ";
//     let divider = 1;
//     for (; divider <= i; divider++) {
//         if (i % divider)
//             continue;
//         sum += divider + comma;
//     }
//     return sum;
// }

// showDividers();

// КОНЕЦ КОДА ЗАДАНИЯ 10 -------------------------------------------------------------------------------------------------------------------------------------------------

// ЗАДАНИЕ 11: Решите задачу 10 в общем виде: вместо 2 и 20 – аргументы x и y.

// КОД ЗАДАНИЯ 11 ---------------------------------------------------------------------------------------------------------------------------------------------------------

// let number1 = 0;
// let error = "";
// do {
//     number1 = +prompt(error + 'Введите нижний порог числа');
//     error = 'Вы ввели неверные данные! ВНИМАНИЕ! ';
// } while (isNaN(number1));
// let number2 = 0;
// error = "";
// do {
//     number2 = +prompt(error + 'Введите верхний порог числа');
//     error = 'Вы ввели неверные данные! ВНИМАНИЕ! ';
// } while (isNaN(number2));

// function showDividers(x,y) {
//     do {
//         console.log('Делители числа ' + x + " - " + calcDividers(x));
//         x++;
//     } while (x <= y);
// }

// function calcDividers(i) {
//     let sum = " ";
//     let comma = " , ";
//     let divider = 1;
//     for (; divider <= i; divider++) {
//         if (i % divider)
//             continue;
//         sum += divider + comma;
//     }
//     return sum;
// }

// showDividers(number1, number2);

// КОНЕЦ КОДА ЗАДАНИЯ 11 -------------------------------------------------------------------------------------------------------------------------------------------------

// ЗАДАНИЕ 12: Создайте функцию с параметрами size (число) и unit (строка). В unit передаются единицы измерения информации («Кб», «Мб», «Гб»), в size – количество таких единиц. Функция возвращает количество байт в size.

// КОД ЗАДАНИЯ 12 ---------------------------------------------------------------------------------------------------------------------------------------------------------

// let number1 = 0;
// let error = "";
// do {
//     number1 = +prompt(error + 'Введите количество единиц информации');
//     error = 'Вы ввели неверные данные! ВНИМАНИЕ! ';
// } while (isNaN(number1));
// let string1;
// error = "";
// do {
//     string1 = prompt(error + 'Введите единицу измерения информации - Кб, Мб, Гб');
//     error = 'Вы ввели неверные данные! ВНИМАНИЕ! ';
// } while (!(string1 === "Кб" || string1 === "Мб" || string1 === "Гб"));

// function calcBytes(size, unit) {
//     switch (unit) {
//         case "Кб":
//             console.log("Количество байт информации - " + BigInt(size * 10 ** 3));
//             break;
//         case "Мб":
//             console.log("Количество байт информации - " + BigInt(size * 10 ** 6));
//             break;
//         case "Гб":
//             console.log("Количество байт информации - " + BigInt(size * 10 ** 9))
//             break;
//         default:
//             console.log("Такое я считать не умею")
//     }
// }

// calcBytes(number1, string1);

// КОНЕЦ КОДА ЗАДАНИЯ 12 -------------------------------------------------------------------------------------------------------------------------------------------------

// ЗАДАНИЕ 13: Создайте функцию, которая ищет наибольший общий делитель двух чисел.

// КОД ЗАДАНИЯ 13 ---------------------------------------------------------------------------------------------------------------------------------------------------------

// let number1 = 0;
// let error = "";
// do {
//     number1 = +prompt(error + 'Введите первое число');
//     error = 'Вы ввели неверные данные! ВНИМАНИЕ! ';
// } while (isNaN(number1) || number1 <=0);
// let number2 = 0;
// error = "";
// do {
//     number2 = +prompt(error + 'Введите второе число');
//     error = 'Вы ввели неверные данные! ВНИМАНИЕ! ';
// } while (isNaN(number2) || number1 <=0);

// function checkNumbers(number1, number2) {
//     if (number1 > number2) {
//         return number2;
//     } else {
//         return number1;
//     }
// }

// let divider = checkNumbers(number1, number2) + 1;
// function getDivider(arg1, arg2) {
//     while (divider > 0) {
//         divider--;
//         if ((arg1 % divider === 0) && (arg2 % divider === 0))
//             break;
//     }
//     console.log("Наибольший общий делитель чисел " + number1 + " и " + number2 + " - число " + divider);
// }
// getDivider(number1, number2);


// КОНЕЦ КОДА ЗАДАНИЯ 13 -------------------------------------------------------------------------------------------------------------------------------------------------

// ЗАДАНИЕ 14: Решите задачу 13 через рекурсию.

// КОД ЗАДАНИЯ 14 ---------------------------------------------------------------------------------------------------------------------------------------------------------

// КОНЕЦ КОДА ЗАДАНИЯ 14 -------------------------------------------------------------------------------------------------------------------------------------------------

// ЗАДАНИЕ 15: Создайте функцию words(),  которая в зависимости от переданного в нее целого числа n, будет выводить слово «карандаш» в правильной форме («12 карандашей», но «22 карандаша»).

// КОД ЗАДАНИЯ 15 ---------------------------------------------------------------------------------------------------------------------------------------------------------

// let number1 = 0;
// let error = "";
// do {
//     number1 = +prompt(error + 'Введите число');
//     error = 'Вы ввели неверные данные! ВНИМАНИЕ! ';
// } while (isNaN(number1) || number1 < 0);

// function words(number1) {
//     if (((number1 % 10) == 1) && (!(number1 == 11)) && (!(number1 % 100 == 11))) {
//         console.log(number1 + " карандаш");
//     } else if (number1 > 10 && number1 < 20) {
//         console.log(number1 + " карандашей");
//     } else if ((number1 % 10) >= 2 && (number1 % 10) <= 4) {
//         console.log(number1 + " карандаша");
//     } else if ((number1 % 10) >= 5 && (number1 % 10) <= 10) {
//         console.log(number1 + " карандашей");
//     } else if (number1 == 0) {
//         console.log(number1 + " карандашей");
//     } else if (number1 % 100 == 11) {
//         console.log(number1 + " карандашей");
//     }
// }

// words(number1);

// КОНЕЦ КОДА ЗАДАНИЯ 15 -------------------------------------------------------------------------------------------------------------------------------------------------

// ЗАДАНИЕ 16: Создайте функцию, которая проверяет, можно ли представить число в виде суммы квадратов двух целых однозначных чисел.

// КОД ЗАДАНИЯ 16 ---------------------------------------------------------------------------------------------------------------------------------------------------------

// let number1 = 0;
// let error = "";
// do {
//     number1 = +prompt(error + 'Введите число');
//     error = 'Вы ввели неверные данные! ВНИМАНИЕ! ';
// } while (isNaN(number1));

// let numberX = 0;
// let numberY = 0;
// function calcSquare(number1) {

//     do {
//         numberX++;
//         numberY = number1 - numberX;
//         if (((Math.sqrt(numberX) % 1) == 0) && ((Math.sqrt(numberY) % 1) == 0)) {
//             return numberX + numberY;
//         } else {
//             continue;
//         }
//     } while ((numberY > 1));
// }

// function checkSquare(number1) {
//     if (calcSquare(number1) == number1) {
//         console.log("Это число представимо в виде суммы квадратов чисел " + Math.sqrt(numberX) + " и " + Math.sqrt(numberY) + ".");
//     } else {
//         console.log("Это число нельзя представить в виде суммы квадратов целых чисел.");
//     }
// }
// checkSquare(number1);

// КОНЕЦ КОДА ЗАДАНИЯ 16 -------------------------------------------------------------------------------------------------------------------------------------------------
