// ЗАНЯТИЕ 35 - Объекты

// ЗАДАНИЕ 1: Создайте объект obj = {a: 1, b: 2, c: 3}. Выведите в консоль элемент с ключом 'c' двумя способами: через квадратные скобки и через точку. Затем выведите все свойства объекта через цикл for..in.


// КОД ЗАДАНИЯ 1 ---------------------------------------------------------------------------------------------------------------------------------------------------------

// let obj = { a: 1, b: 2, c: 3 }

// console.log(obj.c);
// console.log(obj["c"]);

// for (let prop in obj)
//     console.log(prop + ": " + obj[prop]);


// КОНЕЦ КОДА ЗАДАНИЯ 1 -------------------------------------------------------------------------------------------------------------------------------------------------

// ЗАДАНИЕ 2: Создайте объект city, добавьте ему свойства name (название города, строка) и population (население, число).

// КОД ЗАДАНИЯ 2 ---------------------------------------------------------------------------------------------------------------------------------------------------------

// let city = {}

// city.name = "Ivatsevichy";
// city.population = 22400;

// console.log(city);

// КОНЕЦ КОДА ЗАДАНИЯ 2 -------------------------------------------------------------------------------------------------------------------------------------------------

// ЗАДАНИЕ 3: Создайте массив из шести объектов такого же вида, как city из задачи 2 – по одному для каждого областного города Беларуси.

// КОД ЗАДАНИЯ 3 ---------------------------------------------------------------------------------------------------------------------------------------------------------

// let city1 = {};
// let city2 = {};
// let city3 = {};
// let city4 = {};
// let city5 = {};
// let city6 = {};
// let massiv = [city1, city2, city3, city4, city5, city6];

// let names = ["Brest", "Grodno", "Gomel", "Vitebsk", "Minsk", "Mogilev"]
// let population = [340000, 357500, 504000, 360500, 1997000, 355400]

// for (let i = 0; i < 6; i++) {
//     massiv[i].name = names[i];
//     massiv[i].population = population[i];
// }

// console.log(massiv)


// КОНЕЦ КОДА ЗАДАНИЯ 3 -------------------------------------------------------------------------------------------------------------------------------------------------

// ЗАДАНИЕ 4: Напишите функцию, которая принимает массив из задачи 3 в качестве параметра и выводит в консоль информацию о каждом городе.


// КОД ЗАДАНИЯ 4 ---------------------------------------------------------------------------------------------------------------------------------------------------------

// function showMassiv(massiv) {
//     for (let i = 0; i < massiv.length; i++) {
//         for (let prop in massiv[i])
//             console.log(prop + ": " + massiv[i][prop]);
//         console.log('----------------')
//     }
// }

// showMassiv(massiv);

// КОНЕЦ КОДА ЗАДАНИЯ 4 -------------------------------------------------------------------------------------------------------------------------------------------------

// ЗАДАНИЕ 5: Напишите функцию, которая получает в качестве аргументов объект и строку и проверяет, есть ли в этом объекте свойство с именем, равным этой строке.


// КОД ЗАДАНИЯ 5 ---------------------------------------------------------------------------------------------------------------------------------------------------------

// let string = "name";
// let obj = { name: "Artem", age: 26 }



// function checkProperty(obj, string) {
//     if (string in obj) {
//         console.log("Это свойство есть в объекте");
//     } else {
//         console.log("Такого свойства в объекте нет");
//     }
// }

// checkProperty(obj, string);

// КОНЕЦ КОДА ЗАДАНИЯ 5 -------------------------------------------------------------------------------------------------------------------------------------------------

// ЗАДАНИЕ 6: Создайте объект для хранения своего любимого кулинарного рецепта. Он должен содержать название, ингредиенты и их необходимое количество (в виде вложенного объекта), а также количество порций (больше 1). Напишите функцию, которая получает “рецепт”, подсчитывает, сколько каждого ингредиента нужно на одну порцию, и выводит информацию об этом в консоль.


// КОД ЗАДАНИЯ 6 ---------------------------------------------------------------------------------------------------------------------------------------------------------

let recipe = {
    title: "Жареная картошка с грибами",
    portions: 4,
    ingredients: [
        {
            name: "Картошка",
            quantity: 2000,
            unit: "г."
        },

        {
            name: "Зелень (укроп, зеленый лук, петрушка - по вкусу",
            quantity: 40,
            unit: "г."
        },

        {
            name: "Растительное масло",
            quantity: 16,
            unit: "ст. л."
        },

        {
            name: "Грибы (лисички)",
            quantity: 400,
            unit: "г."
        },

        {
            name: "Соль",
            quantity: 2,
            unit: "ч. л."
        },

        {
            name: "Черный молотый перец (опционально, по вкусу)",
            quantity: 1,
            unit: "ч. л."
        }
    ]
}

console.log(recipe);

function showRecipe(recipe) {
    let one = 0;
    console.log("Сегодняшний рецепт - " + recipe.title + "\n" + "Для одной порции нам понадобится следующее:")
    for (let i = 0; i < 5; i++) {
        one = recipe.ingredients[i].quantity / recipe.portions;
        console.log(recipe.ingredients[i].name + ": " + one + " " + recipe.ingredients[i].unit);
    }
}

showRecipe(recipe);

// КОНЕЦ КОДА ЗАДАНИЯ 6 -------------------------------------------------------------------------------------------------------------------------------------------------