'use strict'

// ЗАНЯТИЕ 46-47 - Работа с DOM.

// Найдите (получите в переменную) на странице:

// ЗАДАНИЕ 1 (Презентация): Все элементы label внутри таблицы. Должно быть 3 элемента.

// КОД ЗАДАНИЯ ---------------------------------------------------------------------------------------------------------------------------------------------------------

// let labels = document.querySelectorAll("table label");
// console.log(labels);

// КОНЕЦ КОДА ЗАДАНИЯ -------------------------------------------------------------------------------------------------------------------------------------------------

// ЗАДАНИЕ 2 (Презентация): Первую ячейку таблицы (со словом "Возраст").

// КОД ЗАДАНИЯ ---------------------------------------------------------------------------------------------------------------------------------------------------------

// let table = document.querySelector("table");
// let firstRow = table.rows[0];
// let cell = firstRow.cells[0];
// console.log(cell);

// КОНЕЦ КОДА ЗАДАНИЯ -------------------------------------------------------------------------------------------------------------------------------------------------

// ЗАДАНИЕ 3 (Презентация): Вторую форму в документе.

// КОД ЗАДАНИЯ ---------------------------------------------------------------------------------------------------------------------------------------------------------

// let form = document.querySelectorAll("form")[0];
// console.log(form);

// КОНЕЦ КОДА ЗАДАНИЯ -------------------------------------------------------------------------------------------------------------------------------------------------

// ЗАДАНИЕ 4 (Презентация): Форму с именем search, без использования её позиции в документе.

// КОД ЗАДАНИЯ ---------------------------------------------------------------------------------------------------------------------------------------------------------

// let form = document.getElementsByName("search")[0];
// console.log(form);

// КОНЕЦ КОДА ЗАДАНИЯ -------------------------------------------------------------------------------------------------------------------------------------------------

// ЗАДАНИЕ 5 (Презентация): Элемент input в форме с именем search. Если их несколько, то нужен первый.

// КОД ЗАДАНИЯ ---------------------------------------------------------------------------------------------------------------------------------------------------------

// let form = document.getElementsByName("search")[0];

// let input = form.querySelectorAll("input")[0];
// console.log(input);

// КОНЕЦ КОДА ЗАДАНИЯ -------------------------------------------------------------------------------------------------------------------------------------------------

// ЗАДАНИЕ 6 (Презентация): Элемент с именем info[0], без точного знания его позиции в документе.

// КОД ЗАДАНИЯ ---------------------------------------------------------------------------------------------------------------------------------------------------------

// let testEl = document.getElementsByName("info[0]")[0];
// console.log(testEl);

// КОНЕЦ КОДА ЗАДАНИЯ -------------------------------------------------------------------------------------------------------------------------------------------------

// ЗАДАНИЕ 7 (Презентация): Элемент с именем info[0], внутри формы с именем search-person.

// КОД ЗАДАНИЯ ---------------------------------------------------------------------------------------------------------------------------------------------------------

// let form = document.querySelector("form[name=\"search-person\"]");
// let el = form.querySelector("[name=\"info[0]\"]");
// console.log(el);

// КОНЕЦ КОДА ЗАДАНИЯ -------------------------------------------------------------------------------------------------------------------------------------------------

// ЗАДАНИЕ 8 (Презентация): Добавьте на страницу select с несколькими опциями, свяжите его с лейблом и вставьте оба элемента перед кнопкой «Искать».

// КОД ЗАДАНИЯ ---------------------------------------------------------------------------------------------------------------------------------------------------------

// let form = document.querySelector("form[name=\"search-person\"]");
// let button = document.querySelector("[value=\"Искать!\"]");

// let select = document.createElement("select");
// select.setAttribute("id", "select1");

// let option1 = document.createElement("option");
// option1.setAttribute("value", "option1");
// option1.innerHTML = "Вариант 1";

// let option2 = document.createElement("option");
// option2.setAttribute("value", "option2");
// option2.innerHTML = "Вариант 2";

// let option3 = document.createElement("option");
// option3.setAttribute("value", "option3");
// option3.innerHTML = "Вариант 3";

// select.appendChild(option1);
// select.appendChild(option2);
// select.appendChild(option3);

// select.style.marginLeft = "10px";
// select.style.marginRight = "10px";

// let labelSelect = document.createElement("label");
// labelSelect.setAttribute("for", "select1");
// labelSelect.innerHTML = "Выберите вариант";
// labelSelect.style.marginLeft = "10px";


// button.before(labelSelect);
// labelSelect.after(select);


// КОНЕЦ КОДА ЗАДАНИЯ -------------------------------------------------------------------------------------------------------------------------------------------------
