// ЗАНЯТИЕ 33 - МАССИВЫ

// ЗАДАНИЕ 1: Создайте массив и в цикле заполните его чётными числами от 2 до 20.


// КОД ЗАДАНИЯ 1 ---------------------------------------------------------------------------------------------------------------------------------------------------------

// let evenNums = [];

// for (let i = 0; i < 20; ) {
//     i = i + 2;
//     evenNums.push(i);
// }

// console.log(evenNums);

// КОНЕЦ КОДА ЗАДАНИЯ 1 -------------------------------------------------------------------------------------------------------------------------------------------------

// ЗАДАНИЕ 2: Преобразуйте массив из задачи 1 так, чтобы его элементы стали равны своему индексу, умноженному на 5.

// КОД ЗАДАНИЯ 2 ---------------------------------------------------------------------------------------------------------------------------------------------------------

// let evenNums = [];

// for (let i = 0; i < 20; ) {
//     i = i + 2;
//     evenNums.push(i);
// }

// for (let y = 0; y < evenNums.length; y++) {
//     evenNums[y] = y * 5;
// }

// console.log(evenNums);

// КОНЕЦ КОДА ЗАДАНИЯ 2 -------------------------------------------------------------------------------------------------------------------------------------------------

// ЗАДАНИЕ 3: Получите от пользователя три числа, создайте из них массив. Используя циклы, найдите наибольшее из чисел и разделите на него каждый элемент массива.

// КОД ЗАДАНИЯ 3 ---------------------------------------------------------------------------------------------------------------------------------------------------------

// let number1 = 0;
// let error = "";
// do {
//     number1 = +prompt(error + 'Введите первое число');
//     error = 'Вы ввели неверные данные! ВНИМАНИЕ! ';
// } while (isNaN(number1));
// let number2 = 0;
// error = "";
// do {
//     number2 = +prompt(error + 'Введите второе число');
//     error = 'Вы ввели неверные данные! ВНИМАНИЕ! ';
// } while (isNaN(number2));
// let number3 = 0;
// error = "";
// do {
//     number3 = +prompt(error + 'Введите третье число');
//     error = 'Вы ввели неверные данные! ВНИМАНИЕ! ';
// } while (isNaN(number3));

// let massiv = [number1, number2, number3];

// function checkNumbers(number1, number2, number3) {
//     if (number1 >= number2 && number1 >= number3) {
//         return number1;
//     } else if (number2 >= number3 && number2 >= number1) {
//         return number2;
//     } else if (number3 >= number1 && number3 >= number2) {
//         return number3;
//     }
// }

// for (let i = 0; i < massiv.length; i++) {
//     massiv[i] = massiv[i] / checkNumbers(number1, number2, number3);
// }
// console.log(checkNumbers(number1, number2, number3));
// console.log(massiv);

// КОНЕЦ КОДА ЗАДАНИЯ 3 -------------------------------------------------------------------------------------------------------------------------------------------------

// ЗАДАНИЕ 4: Преобразуйте массив из задачи 2 так, чтобы его элементы расположились в обратном порядке.

// КОД ЗАДАНИЯ 4 ---------------------------------------------------------------------------------------------------------------------------------------------------------

let evenNums = [];

for (let i = 0; i < 20;) {
    i = i + 2;
    evenNums.push(i);
}

for (let y = 0; y < evenNums.length; y++) {
    evenNums[y] = y * 5;
}

console.log(evenNums);

let x = 0;
let reversedArray = [];
for (let y = 0; y < 10; y++) {
    x = evenNums.pop();
    reversedArray[y] = x;
}

console.log(reversedArray);

// КОНЕЦ КОДА ЗАДАНИЯ 4 -------------------------------------------------------------------------------------------------------------------------------------------------